Autodesk.Revit.DB.Fabrication.FabricationUtils.OpenFabricationJob(Autodesk.Revit.DB.Document,System.String,System.Boolean)
Opens fabrication job and adds valid parts found into the current project.
document:
The document to add parts to.
filename:
Full filename of fabrication job to open.
validate:
If true validates all new part connections and disconnects improper ones, with warnings.
Returns:
Returns element identifiers of new elements that are added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The model must not have any fabrication parts.
-or-
Fabrication configuration is missing.
-or-
Fabrication job did not exist at filename.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Fabrication.FabricationUtils.ExportToPCF(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String)
Exports a list of fabrication parts into PCF format.
document:
The document.
ids:
An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename:
The name given to the output file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Fabrication.FabricationUtils.ValidateConnectivity(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Check if two connectors are valid to connect directly without couplings.
document:
The document.
connector1:
First connector to check.
connector2:
Second connector to check against.
Returns:
True if connection is valid otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016